with the help of pandas we convert unstructured data into the structured data.

In [1]:
import numpy as np
import pandas as pd 

import warnings
warnings.filterwarnings('ignore')  #it is used to avoid the warnings incase system will give us warnings

In [2]:
ser = pd.Series() #blank para shows we are making blank series S is in uppercase.
                  # pandas are case sensitive.
ser              #by default it will assume that it is float data

Series([], dtype: float64)

In [3]:
#ser will print series and data type.
#pandas have two structures series and dataframe.

In [4]:
ser = pd.Series([10,20,30,40,50,60,70,80,90])

ser   #it will always show the result with the index numbers
#pandas will automatically generate index numbers

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int64

In [5]:
#lets check another dtype
ser = pd.Series([23,56.56,'89'])

ser  # object is string in pamdas it is known as object 
# with only one object in list the dtype will be showing us as object

0       23
1    56.56
2       89
dtype: object

In [6]:
#create dictionary
# second structure is DataFrame 
# first structure is series

In [7]:
dict = {'A':[1,2,3] , 'B':[4,5,6] , 'C':[7,8,9]}

In [8]:
df = pd.DataFrame(dict) #this will covert dictionary into dataframe 
#it will show values in index and our keys are column

df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [9]:
#how to add more values in dataframe.
df['D'] = "One Two Three".split()

In [10]:
df  #split will check the space and then distribute the values in index

   A  B  C      D
0  1  4  7    One
1  2  5  8    Two
2  3  6  9  Three

In [11]:
df['E'] = [10,20,30]
                    # here 'e' is used because column name is a text.
df

   A  B  C      D   E
0  1  4  7    One  10
1  2  5  8    Two  20
2  3  6  9  Three  30

In [13]:
#how to create Nan values and its manipulation.
dict = {'A':[12,34,np.nan] , 'B':[np.nan , np.nan , 78],'C': [12,34,56,]}

In [14]:
df = pd.DataFrame(dict)
# nan means not a number or missing data
df

      A     B   C
0  12.0   NaN  12
1  34.0   NaN  34
2   NaN  78.0  56

In [16]:
print("\n dropping any column with a nan value\n" ,  '-' * 35)

print(df.dropna(axis= 1)) # it will drop the data with nan value

 dropping any column with a nan value
 -----------------------------------
    C
0  12
1  34
2  56

In [17]:
#axis = 1 means column wise
# axis = 0 means row wise /used for delete data row wise

In [18]:
df  #data is not deleted because pandas will give us oppurtunity to first check the result then save it.

      A     B   C
0  12.0   NaN  12
1  34.0   NaN  34
2   NaN  78.0  56

In [19]:
print("\n dropping any row with a nan value\n" ,  '-' * 35)

print(df.dropna(axis =0))

 dropping any row with a nan value
 -----------------------------------
Empty DataFrame
Columns: [A, B, C]
Index: []

In [20]:
print("\nfilling values with a default values\n" , '-' * 35 , sep='')

print(df.fillna(value = 50))  #used for nan values

filling values with a default values
-----------------------------------
      A     B   C
0  12.0  50.0  12
1  34.0  50.0  34
2  50.0  78.0  56